solutions/chirp_network_solution/app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps"  ORDER BY "chirps"."created_at" DESC
---
	def index
		@chirps = Chirp.all.order(created_at: :desc)

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@chirp = Chirp.find(params[:id])

INSERT INTO "chirps" ("chirp", "created_at", "updated_at") VALUES (?, ?, ?)  [["chirp", "Hey!"], ["created_at", "2015-02-12 19:41:44.170754"], ["updated_at", "2015-02-12 19:41:44.170754"]]
---
	def create
		Chirp.create(chirp: params[:chirp_text])

DELETE FROM "chirps" WHERE "chirps"."id" = ?  [["id", 2]]
SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "chirps" SET "chirp" = ?, "updated_at" = ? WHERE "chirps"."id" = ?  [["chirp", "Hey! THis is an update"], ["updated_at", "2015-02-12 19:44:15.898786"], ["id", 2]]
---
	def update
		if params[:delete_chirp]
			Chirp.find(params[:id]).destroy
		else
			Chirp.find(params[:id]).update_attributes(chirp: params[:chirp_text])